import doctest
from matrix import Matrix

def test_matrix():
    """
    >>> print(repr(Matrix([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]]) + Matrix([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]])))
    Матрица: [[2, 4, 6], [8, 10, 12], [14, 16, 18], [20, 22, 24]]
    >>> print(Matrix([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]]) == Matrix([[12, 11, 10], [9, 8, 7], [6, 5, 4], [3, 2, 1]]))
    False
    >>> print(repr(Matrix([[12, 11, 10], [9, 8, 7], [6, 5, 4], [3, 2, 1]]) * 5))
    Матрица: [[60, 55, 50], [45, 40, 35], [30, 25, 20], [15, 10, 5]]
            
    """

if __name__ == '__main__':
    doctest.testmod(verbose=True)